templates/openfoam/potentialFoam2D/constant/transportProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "constant";
    object transportProperties;
}

transportModel Newtonian;

nu nu [0 2 -1 0 0 0 0] 1.5e-05;
