templates/openfoam/potentialFoam2D/system/blockMeshDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "system";
    object blockMeshDict;
}

scale 1;

vertices ((-5 -3 0) (5 -3 0) (5 3 0) (-5 3 0) (-5 -3 0.1) (5 -3 0.1) (5 3 0.1) (-5 3 0.1));

blocks (hex (0 1 2 3 4 5 6 7) (100 60 1) simpleGrading (1 1 1));

edges ();

boundary (inlet {type patch; faces ((0 4 7 3));} outlet {type patch; faces ((1 2 6 5));} top {type patch; faces ((3 7 6 2));} bottom {type patch; faces ((0 1 5 4));} front {type symmetry; faces ((0 3 2 1));} back {type symmetry; faces ((4 5 6 7));});

mergePatchPairs ();
