templates/openfoam/potentialFoam2D/system/controlDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "system";
    object controlDict;
}

application potentialFoam;

startFrom startTime;

startTime 0;

stopAt endTime;

endTime 1;

deltaT 1;

writeControl timeStep;

writeInterval 1;

purgeWrite 0;

writeFormat ascii;

writePrecision 6;

writeCompression no;

timeFormat general;

timePrecision 6;

runTimeModifiable yes;
